"use strict";
const B = Math.pow(10, 9);
const M = Math.pow(10, 6);
const K = Math.pow(10, 3);
const stateBudget = {
    outcomes: {
        שירותים_חברתיים: {
            חינוך: 79.611940 * B,
            העברות_ביטוח_לאומי: 57.733399 * B,
            בריאות: 45.556773 * B,
            רווחה: 15.232824 * B,
            השכלה_גבוהה: 12.593397 * B,
            תעסוקה: 3.900283 * B,
            מדע_תרבות_וספורט: 2.535972 * B,
            קליטה_ועלייה: 1.957445 * B
        },
        בטחון_וסדר_ציבורי: {
            בטחון: 63.101415 * B,
            בטחון_פנים: 22.158785 * B,
            בטחון_אחר: 16.727742 * B
        },
        החזרי_חוב: {
            ריבית: 43.687421 * B,
            קרן_ביטוח_לאומי: 17.432579 * B
        },
        תשתיות: {
            תחבורה: 33.838493 * B,
            בינוי_ושיכון: 5.382622 * B,
            משק_המים: 0.698711 * B,
            אנרגיה: 0.585823 * B
        },
        הוצאות_אחרות: {
            גמלאות: 21.824107 * B,
            הוצאות_שונות: 8.077111 * B,
            רזרבה: 0 * B
        },
        משרדי_מטה: {
            פנים_ושלטון_מקומי: 8.243727 * B,
            אוצר: 5.028966 * B,
            משפטים: 4.448103 * B,
            ראש_הממשלה: 3.644468 * B,
            חוץ: 1.760609 * B,
            משרדים_נוספים: 1.632849 * B,
            שירותי_דת: 0.793493 * B
        },
        ענפי_משק: {
            כלכלה_ותעשיה: 2.770985 * B,
            חקלאות: 2.209247 * B,
            תיירות: 0.422478 * B,
            הגנה_וסביבה: 0.384025 * B,
            תקשורת: 0.092867 * B
        }
    },
    incomes: {
        taxes: 100 * B
    }
};
// const category = Object.keys(stateBudget.outcomes.ענפי_משק);
// let summary = 0;
// for(let branch = 0; branch < category.length; branch++) {
//     summary += stateBudget.outcomes.ענפי_משק[category[branch]]
// }
